{"cs-000J":{"title":"Analyse complexe","taxon":"Note","tags":[],"route":"cs-000J.xml","metas":{"venue":"Fonctions holomorphes, relations de Cauchy-Riemann. Intégrale curviligne, formule intégrale de Cauchy. Analycité des fonctions holomorphes. Principe des zéros isolés, principe du maximum, théorème de Liouville. Singularités effaçables, pôles, singularités essentielles : théorèmes de Riemann et de Casorati-Weierstrass. Fonctions méromorphes, séries de Laurent. Théorème des résidus. Théorèmes de factorisation de Weierstrass, de Hadamard. Factorisations du sinus, du cosinus. Application : calcul de (2k)."}},"cs-000K":{"title":"Corps et théorie de Galois","taxon":"Note","tags":[],"route":"cs-000K.xml","metas":{"venue":"Corps, extensions de corps. Extensions algébriques, transcendantes. Multiplicativité du degré. Corps de rupture, corps de décomposition, clotûre algébrique. Applications : nombres constructibles, théorème de Gauss-Wantzel. Extensions séparables, corps parfaits, théorème de l'élément primitif. Extensions normales et galoisiennes. Théorème fondamental de la théorie de Galois. Résolubilité par radicaux : théorème de Kummer, groupes résolubles, théorème d'Abel-Ruffini."}},"cs-000H":{"title":"Géométrie différentielle","taxon":"Note","tags":[],"route":"cs-000H.xml","metas":{"venue":"Sous-variétés de {R}^n : immersions, submersions, forme normale. Espace tangent à une sous-variété. Variétés topologiques, {C}^k, lisses. Applications  {C}^k. Trois définitions équivalentes de l'espace tangent. Variétés quotient par une action de groupe. Fibrés vectoriels : définitions, morphismes. Du neuf avec du vieux : somme directe, produit tensoriel, {Hom}, dual, puissances extérieures. Cocycles. Fibré tangent, formes différentielles."}},"cs-000I":{"title":"Représentations de groupes finis","taxon":"Note","tags":[],"route":"cs-000I.xml","metas":{"venue":"Représentations de G et k[G]-modules. Lemme de Schur. Théorème de Maschke. Caractères, orthogonalité. Tables de caractères de quelques exemples. Représentations de dimension finie de {S}_n."}},"cs-000L":{"title":"Surfaces de Riemann","taxon":"Note","tags":[],"route":"cs-000L.xml","metas":{"venue":"Applications multivaluées : monodromie, surface de Riemann d'une application multivaluée. Courbes algébriques complexes affines et projectives. Applications holomorphes entre surfaces de Riemann et revêtements ramifiés. Théorème d'existence de Riemann. Classification des surfaces de Riemann compactes : genre et caractéristique d'Euler. Formule de Riemann-Hurwitz. Application : genre des courbes hyperelliptiques. Théorème d'uniformisation. Exemple : uniformisation des courbes elliptiques, application des périodes."}},"cs-000C":{"title":"Algèbre commutative","taxon":"Note","tags":[],"route":"cs-000C.xml","metas":{"venue":"Anneaux, morphismes d'anneaux. Idéaux : idéaux premiers, maximaux. Existence d'idéaux maximaux. Du neuf avec du vieux : anneaux de polynômes, quotients, localisation. Théorème chinois. Anneaux euclidiens, factoriels, principaux."}},"cs-000D":{"title":"Algèbre linéaire","taxon":"Note","tags":[],"route":"cs-000D.xml","metas":{"venue":"Espaces vectoriels, applications linéaires. Somme directe. Existence de bases et dimension. Dimension finie : théorème du rang, formule de Grassman. Calcul matriciel, algorithme du pivot de Gauss. Dualité. Algèbre multilinéaire, produit tensoriel, déterminant. Réduction des endomorphismes : polynôme caractéristique, polynôme minimal, diagonalisation, trigonalisation, réduction des endomorphismes nilpotents, forme canonique de Jordan, forme canonique de Frobenius. Formes quadratiques, espaces euclidiens, procédé de Gram-Schmidt. Théorème spectral. Théorème d'inertie de Sylvester."}},"cs-000E":{"title":"Analyse réelle","taxon":"Note","tags":[],"route":"cs-000E.xml","metas":{"venue":"Construction de {R} et propriétés topologiques fondamentales. Fonctions réelles : théorème des valeurs intermédiaires, théorème des bornes atteintes, théorème de la limite monotone. Dérivation : formules, théorème de Rolle, accroissements finis, études de variation. Formules de Taylor et développements limités. Suites et séries de fonctions, théorèmes de Weierstrass."}},"cs-000F":{"title":"Espaces fonctionnels","taxon":"Note","tags":[],"route":"cs-000F.xml","metas":{"venue":"Espaces vectoriels normés, applications linéaires continues, théorème de Stone-Weierstrass, théorème de Riesz. Espaces de Banach : théorèmes de Banach-Steinhaus, de l'application ouverte, du graphe fermé. Espaces de Hilbert : bases hilbertiennes, projection sur un convexe fermé, supplémentaires orthogonaux, théorème de représentation de Riesz. Espaces L^p : inégalités de Hölder et de Minkowski, complétude, résultats de densité, dualité. Espaces de Sobolev. Séries de Fourier des fonctions L^1 périodiques. Convergence de la série. Lien entre régularité et décroissance rapide des coefficients. Application à l'équation de la chaleur. Produit de convolution et transformée de Fourier des fonctions L^1. Formule d'inversion, théorème de Plancherel."}},"cs-000G":{"title":"Mesure et intégration","taxon":"Note","tags":[],"route":"cs-000G.xml","metas":{"venue":"Tribus, mesures. Fonctions mesurables. Existence et unicité de la mesure de Lebesgue : mesures extérieures, lemme des classes monotones. Intégrale d'une fonction mesurable positive : fonctions étagées, théorème de convergence monotone. Fonctions intégrables, théorème de convergence dominée. Continuité et dérivabilité des intégrales à paramètres. Mesure produit, théorèmes de Fubini. Changement de variables."}},"cs-000A":{"title":"Topologie générale","taxon":"Note","tags":[],"route":"cs-000A.xml","metas":{"venue":"Espaces métriques, espaces topologiques, fonctions continues. Du neuf avec du vieux : topologie produit, topologie quotient. Compacité : théorème de Bolzano-Weierstrass, théorème de Tychonoff, compactification. Applications de la compacité : théorème des bornes atteintes, théorème de Heine, théorème d'Ascoli. Connexité, connexité par arcs. Complétude : théorème du point fixe. Axiomes de séparation, de dénombrabilité : théorème de métrisabilité d'Urysohn, lemme d'Urysohn, théorème d'extension de Tietze. Théorème de Baire."}},"cs-000B":{"title":"Topologie algébrique","taxon":"Note","tags":[],"route":"cs-000B.xml","metas":{"venue":"Groupe fondamental : homotopie, groupe fondamental d'un produit, théorème de Van Kampen. Revêtements : relèvement des chemins, des homotopies, action de monodromie. Calcul de groupes fondamentaux : le cercle, le tore, le plan épointé... Actions de revêtement, correspondance galoisienne. Existence du revêtement universel, classification des revêtements. Homologe singulière. CW-complexes, homologie simpliciale, équivalence des deux théories. Théorème d'Hurewicz."}},"cs-0008":{"title":"Deuxième conséquence : l'invariance du domaine","taxon":null,"tags":[],"route":"cs-0008.xml","metas":{}},"cs-0005":{"title":"Lemme de Sperner et conséquences","taxon":"Billet","tags":[],"route":"cs-0005.xml","metas":{"venue":"La notion de dimension topologique est une notion délicate : dès la préhistoire de la topologie, en donner une définition formelle apparait comme un défi important. Les intuitions géométriques sur la nature d'un point, d'une ligne ou d'une surface semblent solides ; mais elles sont chamboulées par les travaux de Cantor, qui en 1877 exhibe une bijection entre les points d'un segment et d'un carré, ou de Peano, qui en 1890 construit une courbe continue dont l'image remplit entièrement le cube unité. Il faut donc sauver l'espoir de faire de la dimension un invariant topologique. Se pose alors le problème dit d'invariance du domaine : est il possible de trouver un homéomorphisme entre deux espaces de dimensions ostensiblement différentes ? En 1910, Brouwer démontre qu'un ouvert de {R}^n ne peut être homéomorphe à un ouvert de {R}^m que si n=m. C'est un tour de force, qui préfigure de nombreuses idées de ce qui deviendra la topologie algébrique. En 1928, Sperner donne une nouvelle démonstration au théorème de l'invariance du domaine par une méthode combinatoire. En fait, cette méthode fournit, par ce qu'on nomme maintenant le lemme de Sperner, des démonstration constructives de plusieurs résultats profonds de topologie via des approximations discrètes."}},"cs-0007":{"title":"Première conséquence : le théorème de Brouwer","taxon":null,"tags":[],"route":"cs-0007.xml","metas":{}},"cs-0009":{"title":"Troisième conséquence : le théorème de la boule chevelue","taxon":null,"tags":[],"route":"cs-0009.xml","metas":{}},"cs-0006":{"title":"Un lemme de Sperner constructif","taxon":null,"tags":[],"route":"cs-0006.xml","metas":{}},"cs-0003":{"title":"La représentation de monodromie","taxon":null,"tags":[],"route":"cs-0003.xml","metas":{}},"cs-0002":{"title":"Surfaces de Riemann et revêtement ramifiés","taxon":null,"tags":[],"route":"cs-0002.xml","metas":{}},"cs-0001":{"title":"Compter les revêtements ramifiés","taxon":"Billet","tags":[],"route":"cs-0001.xml","metas":{"venue":"Pellentesque fermentum lorem tellus, id tempus leo aliquet at. Ut nec nibh vel eros tincidunt pharetra eu ut sem. Curabitur sodales sit amet nulla et volutpat. Pellentesque convallis ornare convallis. Proin quis odio sit amet neque blandit pharetra sit amet eu sem. In sollicitudin risus ut urna bibendum laoreet in vitae nibh. Integer consectetur, augue nec tincidunt mattis, nunc orci tincidunt erat, a pellentesque nunc quam in enim. Nunc egestas scelerisque ligula, eget congue odio dapibus at. Integer a tristique augue, quis mollis nisi. Mauris at venenatis nunc, ac ullamcorper ante. Etiam et turpis elementum, sagittis tellus sit amet, sagittis risus. Etiam dignissim tincidunt ligula, non tristique diam posuere nec. Phasellus varius justo ut mollis commodo. Quisque condimentum leo condimentum dolor venenatis pretium. Sed tincidunt ultricies nisi, eget condimentum mi dapibus in. Nam purus nulla, tempus at erat ut, cursus sagittis dui."}},"cs-0004":{"title":"Théorie des groupes","taxon":"Note","tags":[],"route":"cs-0004.xml","metas":{"venue":"Groupes : cycliques, symétriques, linéaires, orthogonaux, affines, diédraux... Sous-groupes distingués, groupe quotient. Actions de groupe, formule des classes et applications. Produits semi-directs. Théorèmes de Sylow. Classification des groupes abéliens finis. Théorème de Jordan-Hölder."}},"lang71":{"title":"Algebra","taxon":"Reference","tags":[],"route":"lang71.xml","metas":{}},"sperner28":{"title":"Neuer Beweis für die Invarianz der Dimensionszahl und des Gebietes","taxon":"Reference","tags":[],"route":"sperner28.xml","metas":{"venue":"Abh. Math. Sem. Univ. Hamburg"}},"brouwer10":{"title":"Beweis der Invarianz der Dimensionenzahl","taxon":"Reference","tags":[],"route":"brouwer10.xml","metas":{"venue":"Math. Ann."}},"peano90":{"title":"Sur une courbe, qui remplit toute une aire plane","taxon":"Reference","tags":[],"route":"peano90.xml","metas":{"venue":"Math. Ann."}},"cantor77":{"title":"Ein Beitrag zur Mannigfaltigkeitslehre","taxon":"Reference","tags":[],"route":"cantor77.xml","metas":{"venue":"J. Reine Angew. Math."}},"constance":{"title":"Constance S.","taxon":"Person","tags":[],"route":"constance.xml","metas":{}},"blog":{"title":"Tous les billets","taxon":null,"tags":[],"route":"blog.xml","metas":{}},"notes":{"title":"Tous les chapitres","taxon":null,"tags":[],"route":"notes.xml","metas":{}}}
